# **Module 3 - SQL CRUD Operations using SQLite Database**

## **Structured Query Language(SQL)**
- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

### **Database Structure** 
- In SQL, data is stored in tables, which are organized into databases. 
- Each table consists of **rows** and **columns**. 
- `Rows` represent individual **records**, while `columns` represent **attributes** or **fields** of those records.

## **Import SQLite3**

In [56]:
import sqlite3

# **Create SQLite Database**
If you want to create the database file in the current directory (where your Jupyter Notebook is located) and specify the name of the database file, you can do it like this:

Replace `database-name.db` with the desired name of your SQLite database file. When you run this command, it will create the SQLite database file in the current directory.

Syntax:
```
conn = sqlite3.connect('database-name.db')
```

Example:

In [57]:
import sqlite3

In [58]:
# .connect(database): Establish a connection to the SQLite3 database file.
conn = sqlite3.connect('sqlite-crud.db')

## **Create a Cursor Object**

- Create a cursor object using the `cursor()` method. The cursor is used to execute SQL commands:

In [59]:
# .cursor(): used to execute SQL commands
cursor = conn.cursor()

## **Create Table**
To define and create a new table in a database, you can use the `CREATE TABLE` statement.

Syntax:
```
cursor.execute("""
CREATE TABLE IF NOT EXISTS table-name (
    column1 data-type constraint,
    column2 data-type constraint,
    ...,
    columnN data-type constraint
);""")
```

Example:

In [60]:
cursor.execute(""" 
CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);""")

conn.commit()

## **Check if the employee table is created successfully.**

In [61]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='employees'")
table_exists = cursor.fetchone()
if table_exists:
  print("The 'employee' table exists in the database.")
else:
  print("The 'employees' table does not exist in the database.")

The 'employee' table exists in the database.

## **Deleting a Table**

If you want to delete the entire table, you can use the `DROP TABLE` statement.

Syntax:
```
cursor.execute("DROP TABLE table-name;")
```

Example:

In [62]:
cursor.execute("DROP TABLE employees;")
conn.commit()

In [63]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='employees'")
table_exists = cursor.fetchone()
if table_exists:
  print("The 'employee' table exists in the database.")
else:
  print("The 'employees' table does not exist in the database.")

The 'employees' table does not exist in the database.

## **Recreate the Table**

In [64]:
cursor.execute(""" 
CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);""")

conn.commit()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name='employees'")
table_exists = cursor.fetchone()
if table_exists:
  print("The 'employee' table exists in the database.")
else:
  print("The 'employees' table does not exist in the database.")

The 'employee' table exists in the database.

## **Check the structure of the table**


To display the structure of a table, including its fields (columns) even if it doesn't have any records yet, you can use database-specific commands:

- `cid`: The **column ID**.
- `name`: The **name** of the column.
- `type`: The **data type** of the column.
- `notnull`: Whether the column cannot contain **NULL values**.
- `dflt_value`: The **default value** of the column.
- `pk`: Whether the column is part of the **primary key**.

Note: 
- We call columns of the table as `fields`.
- We call tables as `schema`.


Syntax:
```
cursor.execute("PRAGMA table_info('table-name');")
cursor.fetchall()
```

Example:

In [65]:
cursor.execute("PRAGMA table_info('employees')")
cursor.fetchall()

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0)]

## **Altering Table**

You might need to alter the table structure at some point. For example, you can add a new column like this:

Syntax:
```
cursor.execute("ALTER TABLE table-name ADD column-name data-type;")
```

Example:

In [66]:
cursor.execute("ALTER TABLE employees ADD hire_date DATE")
conn.commit()

In [67]:
cursor.execute("ALTER TABLE employees ADD performance_rating INT;")
conn.commit()

In [68]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
  employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  department VARCHAR(50),
  salary DECIMAL(10, 2) NOT NULL
  )
""")
conn.commit()

## **Inserting Data**

You can insert data into the employees table using the `INSERT INTO` statement.

Syntax:
```
cursor.execute("""
INSERT INTO table-name (column1, column2, ..., columnN) 
VALUES (value1, value2, ..., valueN);
               """)
```

Example:

In [69]:
cursor.execute("""
  INSERT INTO employees
    (first_name, last_name, department, salary, hire_date, performance_rating)
  VALUES
    ('John', 'Doe', 'Sales', 50000.00, '1997-01-07', 2);
""")
conn.commit()

In [70]:
cursor.execute("""
INSERT INTO employees
    (first_name, last_name, department, salary, hire_date, performance_rating)
VALUES
    ('Jane', 'Smith', 'Marketing', 55000.00, '2024-04-26', 3),
    ('Michael', 'Johnson', 'Sales', 60000.00, '2024-04-27', 5),
    ('Emily', 'Davis', 'Operations', 62000.00, '2024-04-20', 2),
    ('David', 'Wilson', 'Operations', 58000.00, '2024-04-28', 1),
    ('Linda', 'Martinez', 'IT', 70000.00, '2024-04-29', 4),
    ('Robert', 'Anderson', 'Finance', 65000.00, '2024-04-30', 3),
    ('Patricia', 'Taylor', 'HR', 52000.00, '2024-05-01', 5),
    ('Christopher', 'Thomas', 'Marketing', 59000.00, '2024-05-02', 2),
    ('Jennifer', 'Lee', 'Sales', 63000.00, '2024-05-03', 3),
    ('James', 'White', 'Operations', 56000.00, '2024-05-04', 4),
    ('Barbara', 'Harris', 'IT', 68000.00, '2024-05-05', 1),
    ('Daniel', 'Clark', 'Finance', 64000.00, '2024-05-06', 5),
    ('Nancy', 'Lewis', 'HR', 53000.00, '2024-05-07', 2),
    ('Paul', 'Walker', 'Sales', 61000.00, '2024-05-08', 3),
    ('Karen', 'Hall', 'Marketing', 60000.00, '2024-05-09', 4),
    ('Steven', 'Allen', 'IT', 69000.00, '2024-05-10', 5),
    ('Elizabeth', 'Young', 'Finance', 62000.00, '2024-05-11', 2),
    ('George', 'King', 'Operations', 57000.00, '2024-05-12', 3),
    ('Mary', 'Wright', 'HR', 54000.00, '2024-05-13', 4),
    ('Brian', 'Lopez', 'Sales', 62000.00, '2024-05-14', 5),
    ('Megan', 'Hill', 'IT', 71000.00, '2024-05-15', 2),
    ('Anthony', 'Scott', 'Finance', 66000.00, '2024-05-16', 3),
    ('Deborah', 'Green', 'Marketing', 63000.00, '2024-05-17', 4),
    ('Larry', 'Adams', 'Operations', 58000.00, '2024-05-18', 5),
    ('Sarah', 'Nelson', 'HR', 55000.00, '2024-05-19', 2),
    ('Kenneth', 'Carter', 'Sales', 64000.00, '2024-05-20', 3),
    ('Betty', 'Mitchell', 'IT', 72000.00, '2024-05-21', 4),
    ('Ronald', 'Perez', 'Finance', 67000.00, '2024-05-22', 5),
    ('Laura', 'Roberts', 'Marketing', 65000.00, '2024-05-23', 2);
""")
conn.commit()

## **Selecting Data**

You can retrieve data from the employees table using the `SELECT` statement. This will return all rows and columns from the table.

Syntax:
```
cursor.execute("SELECT * FROM table-name;")
```

Example:

In [71]:
cursor.execute("SELECT * FROM employees;")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 50000, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

## **Selecting Specific Columns**
To retrieve data from specific columns of a table, you can use the `SELECT` statement with the column names specified.

Syntax:
```
cursor.execute("SELECT column1, column2, ..., columnN FROM table-name;")
```

Example:

In [72]:
cursor.execute("SELECT first_name, last_name, department FROM employees;")
cursor.fetchall()

[('John', 'Doe', 'Sales'),
 ('Jane', 'Smith', 'Marketing'),
 ('Michael', 'Johnson', 'Sales'),
 ('Emily', 'Davis', 'Operations'),
 ('David', 'Wilson', 'Operations'),
 ('Linda', 'Martinez', 'IT'),
 ('Robert', 'Anderson', 'Finance'),
 ('Patricia', 'Taylor', 'HR'),
 ('Christopher', 'Thomas', 'Marketing'),
 ('Jennifer', 'Lee', 'Sales'),
 ('James', 'White', 'Operations'),
 ('Barbara', 'Harris', 'IT'),
 ('Daniel', 'Clark', 'Finance'),
 ('Nancy', 'Lewis', 'HR'),
 ('Paul', 'Walker', 'Sales'),
 ('Karen', 'Hall', 'Marketing'),
 ('Steven', 'Allen', 'IT'),
 ('Elizabeth', 'Young', 'Finance'),
 ('George', 'King', 'Operations'),
 ('Mary', 'Wright', 'HR'),
 ('Brian', 'Lopez', 'Sales'),
 ('Megan', 'Hill', 'IT'),
 ('Anthony', 'Scott', 'Finance'),
 ('Deborah', 'Green', 'Marketing'),
 ('Larry', 'Adams', 'Operations'),
 ('Sarah', 'Nelson', 'HR'),
 ('Kenneth', 'Carter', 'Sales'),
 ('Betty', 'Mitchell', 'IT'),
 ('Ronald', 'Perez', 'Finance'),
 ('Laura', 'Roberts', 'Marketing')]

## **Updating Data**

If you want to update existing data, you can use the `UPDATE` statement.

Syntax:
```
cursor.execute("""
UPDATE table-name 
SET column-name = new-data 
WHERE primary-key = value;
            """)
```

Example:

In [73]:
cursor.execute("""
    UPDATE employees
    SET salary = 99999
    WHERE employee_id = 1;
""")
conn.commit()
cursor.execute("SELECT * FROM employees")
cursor.fetchall()

[(1, 'John', 'Doe', 'Sales', 99999, '1997-01-07', 2),
 (2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]

## **Deleting Data**

You can delete data from the table using the `DELETE` statement. 

Syntax:
```
cursor.execute("DELETE FROM table-name WHERE primary-key = value;")
```

Example:

In [75]:
cursor.execute("DELETE FROM employees WHERE employee_id = 1;")
conn.commit()

In [76]:
cursor.execute("SELECT * FROM employees;")
cursor.fetchall()

[(2, 'Jane', 'Smith', 'Marketing', 55000, '2024-04-26', 3),
 (3, 'Michael', 'Johnson', 'Sales', 60000, '2024-04-27', 5),
 (4, 'Emily', 'Davis', 'Operations', 62000, '2024-04-20', 2),
 (5, 'David', 'Wilson', 'Operations', 58000, '2024-04-28', 1),
 (6, 'Linda', 'Martinez', 'IT', 70000, '2024-04-29', 4),
 (7, 'Robert', 'Anderson', 'Finance', 65000, '2024-04-30', 3),
 (8, 'Patricia', 'Taylor', 'HR', 52000, '2024-05-01', 5),
 (9, 'Christopher', 'Thomas', 'Marketing', 59000, '2024-05-02', 2),
 (10, 'Jennifer', 'Lee', 'Sales', 63000, '2024-05-03', 3),
 (11, 'James', 'White', 'Operations', 56000, '2024-05-04', 4),
 (12, 'Barbara', 'Harris', 'IT', 68000, '2024-05-05', 1),
 (13, 'Daniel', 'Clark', 'Finance', 64000, '2024-05-06', 5),
 (14, 'Nancy', 'Lewis', 'HR', 53000, '2024-05-07', 2),
 (15, 'Paul', 'Walker', 'Sales', 61000, '2024-05-08', 3),
 (16, 'Karen', 'Hall', 'Marketing', 60000, '2024-05-09', 4),
 (17, 'Steven', 'Allen', 'IT', 69000, '2024-05-10', 5),
 (18, 'Elizabeth', 'Young', 'Finance', 62000, '2024-05-11', 2),
 (19, 'George', 'King', 'Operations', 57000, '2024-05-12', 3),
 (20, 'Mary', 'Wright', 'HR', 54000, '2024-05-13', 4),
 (21, 'Brian', 'Lopez', 'Sales', 62000, '2024-05-14', 5),
 (22, 'Megan', 'Hill', 'IT', 71000, '2024-05-15', 2),
 (23, 'Anthony', 'Scott', 'Finance', 66000, '2024-05-16', 3),
 (24, 'Deborah', 'Green', 'Marketing', 63000, '2024-05-17', 4),
 (25, 'Larry', 'Adams', 'Operations', 58000, '2024-05-18', 5),
 (26, 'Sarah', 'Nelson', 'HR', 55000, '2024-05-19', 2),
 (27, 'Kenneth', 'Carter', 'Sales', 64000, '2024-05-20', 3),
 (28, 'Betty', 'Mitchell', 'IT', 72000, '2024-05-21', 4),
 (29, 'Ronald', 'Perez', 'Finance', 67000, '2024-05-22', 5),
 (30, 'Laura', 'Roberts', 'Marketing', 65000, '2024-05-23', 2)]